from bson import ObjectId

cats = [
    {
        "_id": ObjectId(),
        "name": "Barsik",
        "age": 3,
        "features": ["ходить в капці", "дає себе гладити", "рудий"],
    },
    {
        "_id": ObjectId(),
        "name": "Murka",
        "age": 4,
        "features": ["любить спати на колінах", "активний", "пухнастий"],
    },
    {
        "_id": ObjectId(),
        "name": "Tom",
        "age": 2,
        "features": ["злий на чужих", "пухнастий", "шукає увагу"],
    },
    {
        "_id": ObjectId(),
        "name": "Felix",
        "age": 5,
        "features": [
            "не любить бути на руках",
            "лягає на клавіатуру",
            "муркоче голосно",
        ],
    },
    {
        "_id": ObjectId(),
        "name": "Simba",
        "age": 6,
        "features": ["обожнює рибу", "капає на столі", "територіальний"],
    },
    {
        "_id": ObjectId(),
        "name": "Whiskers",
        "age": 2,
        "features": [
            "слухняний",
            "погано ладнає з іншими котами",
            "дуже боїться вакцини",
        ],
    },
    {
        "_id": ObjectId(),
        "name": "Oscar",
        "age": 1,
        "features": ["лінивий", "пухнастий", "шукає увагу"],
    },
    {
        "_id": ObjectId(),
        "name": "Luna",
        "age": 4,
        "features": ["обожнює грітись на сонечку", "територіальний", "слухняний"],
    },
    {
        "_id": ObjectId(),
        "name": "Shadow",
        "age": 3,
        "features": ["активний", "капає на столі", "муркоче голосно"],
    },
    {
        "_id": ObjectId(),
        "name": "Cleo",
        "age": 7,
        "features": ["любить спати на колінах", "пухнастий", "територіальний"],
    },
    {
        "_id": ObjectId(),
        "name": "Tiger",
        "age": 4,
        "features": ["погано ладнає з іншими котами", "шукає увагу", "лінивий"],
    },
    {
        "_id": ObjectId(),
        "name": "Smokey",
        "age": 5,
        "features": ["обожнює рибу", "територіальний", "муркоче голосно"],
    },
    {
        "_id": ObjectId(),
        "name": "Ginger",
        "age": 3,
        "features": ["злий на чужих", "пухнастий", "шукає увагу"],
    },
    {
        "_id": ObjectId(),
        "name": "Buddy",
        "age": 1,
        "features": ["погано ладнає з іншими котами", "активний", "лінивий"],
    },
    {
        "_id": ObjectId(),
        "name": "Nala",
        "age": 6,
        "features": ["любить спати на колінах", "капає на столі", "територіальний"],
    },
    {
        "_id": ObjectId(),
        "name": "Simone",
        "age": 2,
        "features": ["муркоче голосно", "шукає увагу", "пухнастий"],
    },
    {
        "_id": ObjectId(),
        "name": "Max",
        "age": 8,
        "features": ["не любить бути на руках", "територіальний", "слухняний"],
    },
    {
        "_id": ObjectId(),
        "name": "Charlie",
        "age": 5,
        "features": ["активний", "пухнастий", "не любить бути на руках"],
    },
    {
        "_id": ObjectId(),
        "name": "Bella",
        "age": 3,
        "features": [
            "обожнює грітись на сонечку",
            "любить спати на колінах",
            "пухнастий",
        ],
    },
    {
        "_id": ObjectId(),
        "name": "Leo",
        "age": 2,
        "features": ["шукає увагу", "територіальний", "муркоче голосно"],
    },
]
